# [3.4. Встроенные возможности по работе с коллекциями](https://education.yandex.ru/handbook/python/article/vstroennye-vozmozhnosti-po-rabote-s-kollekciyami)
## A. Автоматизация списка
Многим весьма часто приходится вести списки продуктов, дел и так далее.  

Напишите программу, которая преобразует введённую строку в нумерованный список.  

**Формат ввода**  
Вводится одна строка.  

**Формат вывода**  
Требуется вывести нумерованный список, составленный из её слов.  

---
```python
ls = str(input()).split()

for i, v in enumerate(ls, 1):
    print(f'{i}. {v}')
```

## B. Сборы на прогулку
Воспитатель в детском саду устал тратить время, чтобы построить детей по парам.  

Он договорился с детьми, чтобы те делились на две, по возможности равные, группы.  

Напишите программу, которая по списку двух шеренг составляет пары детей.  

**Формат ввода**  
Вводится две строки с именами детей, записанными через запятую и пробел.  

**Формат вывода**  
Требуется вывести список пар, которые можно составить, если последовательно брать из каждой шеренги по одному ребёнку.
Имена в парах выводить через дефис окружённый пробелами.  

**Примечание**  
В одной из групп может быть на одного ребенка больше, чем в другой.
Этот ребёнок при формировании пар не учитывается и идёт в паре с воспитателем.  

---
```python
ln1 = str(input()).split(', ')
ln2 = str(input()).split(', ')

print('\n'.join([' - '.join(i) for i in list(zip(ln1, ln2))]))
```

## C. Рациональная считалочка
Напишите программу, которая производит счёт по заданным параметрам.  

**Формат ввода**  
В одну строку через пробел вводятся 3 рациональных числа — начало счета, конец и шаг.  

**Формат вывода**  
Последовательность чисел с заданными параметрами.  

---
```python
from itertools import count

nums = input().split(' ')

strt = float(nums[0])
end = float(nums[1])
stp = float(nums[2])

for strt in count(strt, stp):
    if strt > end:
        break
    print(round(strt, 2))

```

## E. Список покупок
Поход в магазин часто вызывает проблемы. Если не подготовить список, можно уйти в магазин за хлебом, а вернуться с десятком пакетов. Напишите программу, которая собирает пожелания семьи (мамы, папы и дочки) в единый список.  

**Формат ввода**  
В трёх строках записаны желаемые продукты (через запятую и пробел).  

**Формат вывода**  
Отсортированный по алфавиту список продуктов с нумерацией.  

**Примечание**  
Помните, что итераторы можно применять к другим итераторам.  

---
```python
ls1, ls2, ls3 = input().split(', '), input().split(', '), input().split(', ')

for i, v in enumerate(sorted(ls1 + ls2 + ls3), 1):
    print(f'{i}. {v}')
```

## G. Игровая сетка
Ребята в классе решили устроить чемпионат по шашкам. К сожалению, количество учеников не является степенью двойки и поэтому классическую турнирную сетку создать сложно. Для выявления фаворитов ребята договорились сыграть по принципу «каждый с каждым». Продумайте программу, которая составляет список необходимых игр.  

**Формат ввода**  
В первой строке записано число учеников (N).  
В каждой из последующих N строк записано одно имя.  

**Формат вывода**  
Список игр в формате:  
<Игрок 1> - <Игрок 2>  
Порядок игр не имеет значения.  

---
```python
from itertools import combinations

n = int(input())
plLs = [input() for i in range(n)]

print('\n'.join([' - '.join(i) for i in list(combinations(plLs, 2))]))
```

## H. Меню питания 2.0
В детском саду ежедневно подают новую кашу на завтрак.  

Напишите программу, которая строит расписание каш на ближайшие дни.  

**Формат ввода**  
Вводится натуральное число M — количество каш в меню. В каждой из последующих M строк записано одно название каши. В конце передается натуральное число N — количество дней.  

**Формат вывода**  
Вывести список каш в порядке подачи.  

**Примечание**  
Советуем изучить документацию на функцию itertools.islice, которая реализует срезы на основе итераторов.  

---
```python
from itertools import islice, cycle

m = int(input())
prrdge = [input() for i in range(m)]

n = int(input())

print('\n'.join([i for i in islice(cycle(prrdge), n)]))
```

## L. Список покупок 2.0
Давайте вновь поможем человеку с покупками. Разработайте программу, которая собирает пожелания семьи в единый список.  

**Формат ввода**  
В первой строке задано натуральное число N — количество членов семьи. В следующих N строках записаны желаемые продукты (через запятую и пробел).  

**Формат вывода**  
Отсортированный по алфавиту список продуктов с нумерацией.  

**Примечание**  
Помните, что итераторы можно хранить в списке, а его можно распаковать в любую функцию.  

---
```python
from itertools import chain

n = int(input())

ls = [str(input()).split(', ') for i in range(n)]

print('\n'.join([f'{i}. {v}' for i, v in enumerate(sorted(chain.from_iterable(ls)), 1)]))
```

## M. Расстановка спортсменов
Расстановка спортсменов на старте — сложная задача. Однако при помощи итераторов она решается за пару строк. Напишите программу, которая выводит список возможных расстановок спортсменов на старте.  

**Формат ввода**  
В первой строке задано натуральное число N — количество спортсменов. В следующих N строках записаны имена спортсменов.  

**Формат вывода**  
Отсортированный по алфавиту список расстановок.  
Имена в каждой строке выводить через запятую и пробел.  

---
```python
from itertools import permutations

n = int(input())

ls = [str(input()) for i in range(n)]

print('\n'.join([', '.join(i) for i in permutations(sorted(ls))]))
```

## N. Спортивные гадания
Хорошо, спортсмены расставлены на старте. Вот только угадать финалистов практически невозможно. Давайте напишем программу, которая выводит список возможных победителей.  

**Формат ввода**  
В первой строке задано натуральное число N — количество спортсменов. В следующих N строках записаны имена спортсменов.  

**Формат вывода**  
Отсортированный по алфавиту список вариантов.  
Имена в каждой строке выводить через запятую и пробел.  

---
```python
from itertools import permutations

n = int(input())

ls = [str(input()) for i in range(n)]

print('\n'.join([', '.join(i) for i in permutations(sorted(ls), 3)]))
```

## O. Список покупок 3.0
В этот раз семья договорилась о том, что в целях экономии бюджета, они будут совершать в день только три покупки. Напишите программу, которая готовит варианты списков покупок.  

**Формат ввода**  
В первой строке задано натуральное число N — количество членов семьи. В следующих N строках записаны желаемые продукты (через запятую и пробел).  

**Формат вывода**  
Варианты списков покупок в алфавитном порядке.  

---
```python
from itertools import permutations, chain

n = int(input())

ls = [str(input()).split(', ') for i in range(n)]

print('\n'.join([' '.join(i) for i in permutations(sorted(chain.from_iterable(ls)), 3)]))
```

## R. Таблица истинности
Вся современная электронно-вычислительная техника строится на Булевой алгебре, которая оперирует истинностью и ложностью высказываний. Любой язык программирования содержит логические операции (в Python это and, or, not).  
  
Чаще всего для работы со сложными высказываниями прибегают к методу под названием «Таблица истинности».  
Суть метода проста — рассматриваются все возможные значения входных переменных и для них вычисляется результат.  
  
Разработайте программу, которая для введённого сложного логического высказывания строит таблицу истинности.  

**Формат ввода**  
Вводится логическое выражение от трех переменных (a, b, c) валидное для языка Python.  

**Формат вывода**  
Выведите таблицу истинности данного выражения.  

**Примечание**  
Для выполнения Python кода, записанного в строках, существуют две замечательные функции: exec и eval.  

---
```python
from itertools import product

truth_table = list(product([0, 1], repeat=3))

line = str(input())

print('a b c f')
print('\n'.join([f'{a} {b} {c} {int(eval(line))}' for a, b, c in truth_table]))
```
